//1. რა დააბეჭდავს ეს კოდი და რატომ?
 
let x = 5;
let y = "5";

console.log(x == y);
console.log(x === y);

//answer
// == true (ტიპებს არ ადარებს)

// === false (ტიპებიც ადარებს)

//2. შექმენი ფუნქცია, რომელიც იღებს ორ რიცხვს და აბრუნებს მათ ჯამს
function func(){

}

//3. რა არის let, const და var განსხვავება?


//4. გადმოგეცემათ მასივი, რომელიც შეიცავს რიცხვებს. დაწერე ფუნქცია, რომელიც დააბრუნებს ახალ მასივს მხოლოდ უნიკალური მნიშვნელობებით.
function getUnique(arr) {
    // your code
  }
  
  getUnique([1, 2, 2, 3, 4, 4, 5]) // ➜ [1, 2, 3, 4, 5]

  
  //5. რა არის this მნიშვნელობა ობიექტის მეთოდში, ჩვეულებრივ ფუნქციაში და arrow ფუნქციაში?


//   6. დაწერე debounce ფუნქცია
// ამოცანა:
// დაწერე ფუნქცია debounce, რომელიც ამუხრუჭებს სხვა ფუნქციის გამოძახებას გარკვეული დროით (მაგ. 300ms).
function debounce(fn, delay) {

}
  